// CPP05_For.cpp
// 반복문 + 함수 + 스코프 -> 레퍼런스
#include <iostream>
#include <vector>
using namespace std;
// ===================================================================
int main() {
    // 반복문 사용법
    // for(초기화; 조건식; 증감식){실행할놈}
    // 1~10 -> i=0
    for(int i=0; i<10 ; i++){
        // 0 1 2 3 4 5 6 7 8 9 
        // i가 0부터 10미만까지 1씩 증가하면 몇 번 ?
        cout << i << " ";
    }
    cout << endl;
    // 10~1
    for(int i=0; i<10; i++){
        cout << 10 - i << " ";
    }
    cout << endl;
    // vector의 조작
    vector<int> v;
    // 벡터에 1~10까지 숫자를 저장! (push_back)
    for(int i=0; i<10; i++){
        v.push_back(i+1);
        cout << v[i] << " ";
    }
    cout << endl;
    // 향상된 for문! ⭐⭐⭐
    for(int& i : v){ // 1 2 3 4 5 6 7 8 9 10
        cout << i << " ";
        i = i + 3; // 원본 변경????
        // 레 퍼 런 스 쓰 면 댐. 
    }
    cout << endl;
    for(int i : v){
        cout << i << " ";
    }
    cout << endl;
    // ------------------------------------------
    // 벡터를 하나 만들어서, 10부터 1까지 넣고
    // 출력을 하되, 출력후 1씩 감소시킴(원본을)
    // 이후 다시 벡터 확인.
    vector<int> v2;
    for(int i=0;i<10;i++){
        v2.push_back(10-i);
    }
    for(int& i : v2){
        cout << i << " ";
        i -= 1; // i = i - 1
    }
    cout << endl;
    

    // -----------------------------------------------
    // 향상된 for문 어케 씀?
    // ⭐ 반드시 여러개 뭉쳐있는 놈한테 쓸 수 있음.
    // 배열, 벡터 등등....
    // for( 받을놈 : 넣을놈 ){
    //      실행할놈
    //}
    // 넣을놈에서 "차례대로" 하나씩 빼서 받을 놈에 넣고
    // 실행할놈을 실행. 이후 다시 넣을놈에서 "차례대로"...
    

    












}// ====================================================================