// C02_Printf2.c
#include <stdio.h>
int main()
{
    // 세련되게 출력하기 + 특수기호 출력하기
    // printf의 " 안에 " 특수기호를 넣으면 일부는 박살남
    // 그래서 어케하냐? -> 한번 더 쓰거나 \ 역슬래쉬 붙이자.
    // -----------------------------------------

    printf("\\    /\\\n");
    printf(" )  ( \')\n");
    printf("(  /  )\n");
    printf(" \\(__)|\n");
    // 고양이 만들기

    printf("|\\_/|\n");
    printf("|o o|   /\n");
    printf("( W )\"\"\"\\\n");
    printf("|\"^\"     |\n");
    printf("||_/=\\\\  |\n"); 
    // 강아지 만들기 

    



    


}
