// C08_Array1.c
#include <stdio.h>
#include <stdlib.h> // 표준 라이브러리. 별게 다 있음.
#include <time.h> // 시간 정보
// rand() : 0~32767 무작위의 정수 하나 툭 나옴.
// 내가 원하는 형시으로 변환
// rand()%숫자범위 + 최소값
// 1~10 : rand()%10 : 0~9, rand()%10 + 1 : 1~10
// =============================================
void E(){
    printf("--------\n");
}
int main(){
    srand(time(NULL)); // 랜덤을 위한 시드 섞기
    // --------------------------------------
    // 기본 배열 생성
    int ary1[5]; // 5개 만들어지고, 쓰레기값!
    int ary2[5] = {0}; // 5개 만들어지고 다 0
    int ary3[5] = {1,2,3,4,5}; // 5개 1 2 3 4 5
    //int ary4[]; // 이거만 쓰면 에러. 초기화필요
    int ary5[] = {1,2,3}; // 3개 만들어짐 1 2 3
    // ---------------------------------------
    // 기본 배열 사용
    int ary6[5] = {1,2,3,4,5};
    printf("ary6[%d] : %d\n", 0, ary6[0]);
    printf("ary6[%d] : %d\n", 1, ary6[1]);
    printf("ary6[%d] : %d\n", 2, ary6[2]);
    printf("ary6[%d] : %d\n", 3, ary6[3]);
    printf("ary6[%d] : %d\n", 4, ary6[4]);
    ary6[0] = 10; // 01234 -> Index
    ary6[1] = 20;
    ary6[2] = 30;
    ary6[3] = 40; // 배열에서 하나 뜯어내면
    ary6[4] = 50; // 일반 변수처럼 사용가능
    printf("ary6[%d] : %d\n", 0, ary6[0]);
    printf("ary6[%d] : %d\n", 1, ary6[1]);
    printf("ary6[%d] : %d\n", 2, ary6[2]);
    printf("ary6[%d] : %d\n", 3, ary6[3]);
    printf("ary6[%d] : %d\n", 4, ary6[4]);
    E();
    // --------------------------------------
    // 반복문을 이용한 배열
    int ary24[5] = {0}; // 앵간하면 0으로 초기화
    for(int i=0;i<5;i++){
        ary24[i] = i + 1;
        printf("ary11[%d] : %d\n", i, ary24[i]);
    }   printf("\n");
    // 10~50 넣기 + 출력
    int ary7[5] = {0}; // 앵간하면 0으로 초기화
    for(int i=0;i<5;i++){
        ary7[i] = (i+1)*10;
        printf("ary7[%d] : %d\n", i, ary7[i]);
    }   printf("\n");
    E();
    // --------------------------------------
    // ary8 100개 만들어서, 요 안에 1~100 넣고
    // 모든 요소를 공백단위로 출력.
    // 1 2 3 4 5 6 7...
    int ary8[100] = {0};
    for(int i=0;i<100;i++){
        ary8[i] = i+1;
        printf("%d ",ary8[i]);
    }   printf("\n"); E();
    // --------------------------------------
    // ary9 int 200개만들어서, 짝수만2부터 넣고
    // 출력. i는 항상 0부터.
    int ary9[200] = {0};
    for(int i=0;i<100;i++){
        ary9[i] = (i+1)*2;
        printf("%d ",ary9[i]);
    }   printf("\n"); E();
    // --------------------------------------
    // 숫자 두개를 n1, n2에 임의로 작성하고
    // ary10에 300개 짜리에 1부터 순서대로 값
    // 을 저장후, n1부터 n2까지의 숫자가 나오게
    // 코드를 작성하세요
    int n1=100, n2=120; // i가 0부터 시작 안해도 됨
    int ary25[300] = {0};
     for(int i=n1;i<=n2;i++){
        ary25[i] = i;
        printf("%d ",ary25[i]);
    }   printf("\n"); E();

    //int n1=100, n2=120;
    //int ary10[300] = {0};
    //for(int i=0;i<=300;i++){
    //    ary10[i] = i+1;
    // }
    // 출력 구현
    // If를 활용
    for(int i=0; i<300;i++){
        if(ary25[i]>=n1 && ary25[i]<=n2){
            printf("%d ", ary25[i]);
        }
    }   printf("\n"); E();
    // For를 조작
    for(int i=n1-1;i<=n2; i++){
        printf("%d ",ary25[i]);
    }   printf("\n"); E();
    // FOR를 조작 Hard
    //for(int i=0; i<n2-n1+1;i++){
    //   printf("%d ",ary10[i+n1]);
    // }   printf("\n"); E();
    // -----------------------------------
    // n1과 n2에 값을 입력 ( 이때 누가 큰지 모름)
    // n1부터 n2까지의 값을 출력하되, 3의 배수는
    // 생략해서 출력하세요.
    n1 =120, n2=100;
    // 첫번째 방법
    int temp=0;
    int ary10[300] = {0}; // 범위 : 1 ~ 300
    if(n1>n2){
        int temp = n1;
        n1 = n2;
        n2 = temp;
    }
    for(int i=n1-1;i<=n2; i++){
        if(ary10[i]%3==0)continue;
        printf("%d ",ary10[i]);
    }

    // 두번째 방법
    n1=120, n2=100;
    if(n1>n2){
        for(int i=n2-1;i<=n1; i++){
        if(ary10[i]%3==0)continue;
        printf("%d ",ary10[i]);
        }


    }
    else{
        for(int i=n1-1;i<=n2; i++){
        if(ary10[i]%3==0)continue;
        printf("%d ",ary10[i]);
        }
    }
    // ----------------------------------------
    // 배열만들어서 랜덤값 넣기.
    int ary11[100] = {0};
    // 1~50중, 랜덤 숫자 채워넣기
    // rand() // 0~32767
    // rand()%50 // 0~49
    // rand()%50 + 1 // 1~50
    for(int i=0; i<100;i++){
        ary11[i] = rand()%50 + 1;
        printf("%d ", ary11[i]);
    }   printf("\n"); E();

    // ----------------------------------
    // ary12에 50개짜리 랜덤값(1~100)을 넣고출력
    // 여기서 짝수가 몇개, 홀수가 몇개인지 출력
    int sumEven=0; // 짝수
    int sumOdd =0; // 홀수
    int ary12[100] = {0};
    for(int i=0; i<50;i++){
        ary12[i] = rand()%100 + 1;
        printf("%d ", ary12[i]);
        if(ary12[i]%2==0)
            sumEven++;
        else{
            sumOdd++;
        }
       
    }   printf("\n"); E();

    printf("Even : %d\n", sumEven);
    printf("Odd :  %d\n",  sumOdd);
    // -----------------------------------------------------
    // ary14에 100개짜리 랜덤숫자 다 1~100 넣고
    // 입력 하나 받아서, 그놈 어디에 있는지
    // 최초 1회만 출력. 근데 없으면 X를 출력.
    int ary14[100] = {0};
    int flag=0; // 얘가 0이 아니면? 출력된 적 O
    int target=0;
    scanf("%d", &target);
    for(int i=0;i<100;i++){
        ary14[i] = rand()%100 + 1;
        printf("%d ",ary14[i]);
        if(ary14[i]==target){
            printf("Target : %d\n",ary14[i]);
            flag++;
            break;
        }
    }
    if(flag==0){
        printf("X\n");
    }








    // -----------------------------------------------------
    // <추가 숙제>
    // ary13에 200개짜리 배열을 만들고
    // 랜덤값을 1~10까지 넣습니다. 이후 모든
    // 요소를 출력하되, 2의배수는 0으로 변환
    // 이후 3의 배수는 1로 변환해서 출력하세요.

    int ary13[100] = {0};
    

        
    
    



    // --------------------------------------
    // --------------------------------------
    // --------------------------------------
    // --------------------------------------
    // --------------------------------------

} // ===========================================
/* ---------------------------------------------
< 배열 = Array -> arr, ary >
1. 뭐하는놈이니 : 여러 변수들 한번에 만듬
2. 왜써? : 관리하기 편함
3. 어케 만듬
자료형 이름[개수] = {초기화할놈들}
4. 초기화 꼭 해야해? : 응. {0}라도 넣어.
5. [개수]를 비우면 안돼?
   -> 되는데 꼭 초기화해야하고, 초기화 한
      데이터 개수 만큼 배열이 만들어짐
6. 나중에 배열 크기 조정가능? : 되겠냐.
int as[1000]
7. 빈공간은 손실아님? : 맞음. 그래서 최소한
   공간 써야하는데 어려움 -> 나중에 동적할당      

   // 교환하기
    // A, B를 교환을 하려면
    // 임시변수 하나 temp
    // temp = A, A = B, B = temp;
    int a = 10;
    int b = 20;
    int temp = b;
    b = a;
    a = temp;
    printf("%d, %d",a,b);
    

------------------------------------------------- */