// C13_Pointer2.c
#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <windows.h>
#include <string.h>
// ===============================================================
// < 함수 자리 >
// ===============================================================

// ===============================================================
int main(){
    srand(time(NULL));
    // --------------------------------------------------
    // < 포인터 확인 >
    int x = 10;
    int* ptr = &x;
    // --------------------------------------------------
    printf("%d\n",x  ); // 10 
    printf("%d\n",&x ); //  A
    printf("%d\n",ptr ); // A
    printf("%d\n",*ptr ); // *A = 10
    printf("%d\n",*&*&*&*&*&*&*&x);
    printf("%d\n", &ptr); // 가 
    printf("%d\n", *&ptr); // *가  = A
    printf("%d\n", **&ptr); // **가  = *A = 10

    // *&*&**&*&ptr 의 결과는?
    printf("%d\n", *&*&**&*&ptr); // 10

    int y=20;
    ptr = &y;  ptr = &x;  ptr = &y;
    printf("%d\n", &y );  // B
    printf("%d\n", ptr);  // B

    *ptr = 999;
    //*B -> B의 주소로 이동 후 데이터공간 사용
    printf("%d\n", y );  // 999

    // <실습>
    // ptr을 이용해서, x안의 데이터를 777로 바꾸세요
    ptr = &x;
    *ptr = 777;
    printf("%d\n", x ); // 777

    // ---------------------------------------------------
    // <실습>
    // ptr2는 int의 주소값을 저장할수있는 포변
    // int z를 만든후, ptr와 ptr2를 이용해서
    // z의 공간 안에 x와 y의 값의 합계를 넣으세요
    // ( 단, x,y를 이용해 직접 값을 넣는 것은 금지합니다. )
    // (추가예제) ptr2를 쓰지 않고 ptr만 사용해서 문제를 해결하세요
    // ----------------------------------
    // int* ptr2;
    // ptr2 = &y;
    // int z;
    // z = *ptr + *ptr2;
    // <추가예제풀이>
    int z=0;
    z += *ptr;
    ptr = &y;
    z += *ptr;
    printf("Z : %d\n",z); // 1776(999+777)
  


    



}// =============================================================
