// C13_Pointer4.c
#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <windows.h>
#include <string.h>
// ===============================================================
// < 함수 자리 >
// ===============================================================
// ===============================================================
int main(){
    srand(time(NULL));
    // -------------------------------------------------
    int ary[3] = {10,20,30};
    printf("%d\n", ary); // A
    printf("%d\n", &ary[0]); // A
    printf("%d\n", ary+0); // A
    // --------------------------------
    printf("%d\n", ary); // A+1 = 점프
    printf("%d\n", &ary[1]); // A+1 ?? 4증가
    printf("%d\n", ary+1); // A+1 ?? 4증가
    // ----------------------------------
    printf("%d\n", ary); // A+2
    printf("%d\n", &ary[2]); // A+2 ?? 8증가
    printf("%d\n", ary+2); // A+2 ?? 8증가
    // ----------------------------------------------
    printf("------------------------\n");
    // ------------------------------------------------
    // 첫 데이터 출력
    printf("%d\n",     *ary);
    printf("%d\n", *(ary+0));
    printf("%d\n",   ary[0]);
    printf("%d\n",  *&ary[0]);
    // ------------------------------------------------
    // 두번째 데이터 출력
    printf("%d\n",        *ary+1); // ⭐주의하기
    printf("%d\n",      *(ary+1));   // *는 우선순위 높음 
    printf("%d\n",        ary[1]);
    printf("%d\n",      *&ary[1]);
    // ------------------------------------
    // 포인터 변수 활용하기
    // ------------------------------------
    int* ptr = ary;
    printf("%d\n", ptr); // A
    printf("%d\n", ary); // A
    printf("%d\n", ptr+1); // A+1
    printf("%d\n", ary+1); // A+1
    printf("%d\n", *(ptr+1)); // 20
    printf("%d\n", *(ary+1)); // 20
    printf("%d\n", ptr[1]); // 20
    printf("%d\n", ary[1]); // 20
    // --------------------------------------------
    // sizeof(뭔가) -> 뭔가가 몇 바이트인지 
    // sizeof(int) -> 4
    // sizeof(double) -> 8
    // int ary[100];
    // sizeof(ary) -> 100*4
    // --------------------------------------------
    printf("ary Size : %d\n", sizeof(ary));
    printf("ary Element : %d\n", sizeof(ary)/sizeof(int));
    printf("ary Size : %d\n", sizeof(ptr));
    printf("ary Element : %d\n", sizeof(ptr)/sizeof(ptr));
    // ?????????????????????????? 뭔가 이상함
    // 포인터 변수는 무조건 9 Byte. 배열의 사이즈 모름
    // => 함수는 쓸 때는 반드시 "몇개인지"도 보내야함
    double* ptr2;
    char* ptr3;
    short* ptr4;
    printf("ptr2 Size : %d\n", sizeof(ptr2));
    printf("ptr3 Size : %d\n", sizeof(ptr3));
    printf("ptr4 Size : %d\n", sizeof(ptr4));
    



}// -=============================================================
/* ---------------------------------------------------------------
< 배열 >
int ary[5] => ㅁㅁㅁㅁㅁ
ary[0], ary[2] -> "데이터 공간" 사용
ary -> ???? => 첫 요소의 시작 주소값을 데이터 공간에 가지고 있음
⭐ 배열이름은 사실 포인터 변수였다...!
ary[0] = *(ary+0) A+0
ary[1] = *(ary+1) A+1
ary[x] = *(ary+x) A+x
int* ptr = ary;
*(ptr+0) = *(A+0) = *(ary+0) = ary[0] = ptr[0]
*(ptr+1) = *(A+1) = *(ary+1) = ary[1] = ptr[1]
*(ptr+i) = *(A+i) = *(ary+i) = ary[i] = ptr[i]
배열이름[인덱스] -> 그 배열에서 인덱스만큼 점프 후 데이터공간 사용
포인터 변수에 배열을 그냥 담으면? -> 배열처럼 쓸 수 있다!!!
---------------------------------------------------------------------*/  