// C14_DoublePointer.c.
#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <windows.h>
#include <string.h>
// =========================================================
// < 함수 자리 >
// =========================================================

// =========================================================
int main(){
    srand(time(NULL));
    // ---------------------------------------
    int x     = 10; // A
    int y     = 20; // AA
    int *ptr1 = &x; // B
    int *ptr2 = NULL; // BB NULL : 비어이음. True가 아님
    int **dptr = &ptr1; // C
    // ---------------------------------------
    printf("%d\n", &x   ); // A
    printf("%d\n", ptr1 ); // A
    printf("%d\n", dptr ); // B
    printf("%d\n", *dptr); // A
    // < 실습 > x, ptr1, dptr을 이용해서 10이 나오게끔 해주세요
    printf("%d\n", x      ); // 10
    printf("%d\n", *ptr1  ); // 10
    printf("%d\n", **dptr ); // 10
    // ---------------------------
    // 1. ptr2에 y를 연결
    // 2. dptr에 ptr2를 연결
    // 3. y, ptr2, dptr을 이용해서 숫자 20을 모두 출력
    ptr2 = &y;
    dptr = &ptr2;
    printf("%d\n", y      );
    printf("%d\n", *ptr2  );
    printf("%d\n", **dptr );
    // -----------------------------
    // ChangePtr은, 포인터변수의 주소와
    // 일반 변수의 주소를 받아서
    // 포변에 해당 주소를 저장할 수 있게 하세요
    ChangePtr(&ptr1, &y); // 함수 쉽게 만들기
    // 원본에 변경이 필요하면 &로 주소넘기기
    printf("Ptr1 : %d\n", *ptr1);

    
}// ========================================================
/*----------------------------------------------------------

----------------------------------------------------------*/