// CProblemSolution.c
#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <windows.h>
#include <string.h>
int alpha[26] = {0};
// ===============================================================
// < 함수 자리 >
// ===============================================================
// 문자열을 함수에 전달해서 역순으로 출력
void PrintRString(char* str){
    int length = 0;
    for(int i=0; *(str+i) != '/0'; i++){
        length++;
    }
    for(int i=0; *(str+i) != '/0'; i++){
        printf("%c", *(str+i));
    }
}
// 문자열 두개를 전달받아 첫번째 문자열 뒤쪽에 두번째 문자열을 붙여서 저장하세요(strcat 금지)
void Concat(char* str1, char* str2){
    int length = 0;
    for(int i=0; *(str1+i) != '/0'; i++ ){
        length++;
    }
    for(int i=0; *(str2+i) != '/0'; i++ ){

    }

}
// 전역변수 alpha를 선언, 문자열을 함수에 전달해서
// 소문자 알파벳 각각 몇개인지 저장
// int alpha[26] = {0};
// 0 1 2 3 4 5 6 7 8 9 10 11 12 ...
// a b c d e f g h i j k l n ..
// 97 98 999 ...
// 결론. 소문자에 -97을 하게 되면, 0~25가 됨.
void LowerCount(char* str){
    for(int i=0; *(str+i) != '\0'; i++){
        // 소문자 97~122
        if( *(str+i) >= 97 && *(str+i) <= 122 ){
            int index = *(str+i) - 97; // 97~122 - 97 -> 0~25
            alpha[index]++;
        }
    }
}
// ===============================================================
int main(){
    srand(time(NULL));
    

}// -=============================================================
/* ---------------------------------------------------------------

-------------------------------------------------------------------*/  