// 숫자를 10개 저장할 수 있는 array 배열과, 배열을 사이즈 size 를 저장할 수 있는
// Arrays 구조체를 선언한 후, 이 구조체를 전달받을 경우 배열 안의 모든 요소에 1부터
// 순서대로 값을 넣어주는 InitArrays 함수를 구현하세요
#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <string.h>
// ===============================================================
// < 구조체 자리 >
typedef struct{
    int ary[10];
    int size;
}Arrays;
// ===============================================================

// ===============================================================
// < 함수 자리 >
// ===============================================================
void InitArrays(Arrays* a, int size){
    a->size=size;
    for(int i=0;i<a->size;i++){
        a->ary[i]=i+1;
        printf("%d ",a->ary[i]);
    }
}
// ===============================================================
int main(){
    srand(time(NULL));
    // --------------------------------------------------------
    Arrays a;
    InitArrays(&a, 10);
    
    
    
}// ==============================================================
/* ---------------------------------------------------------------

-------------------------------------------------------------------*/  

