// Practice3.c
#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <windows.h>
#include <string.h>
// ===============================================================
// < 구조체 자리 >
// ===============================================================

// ===============================================================
// < 함수 자리 >
// ===============================================================
// 숫자 넘겨주면, 배열 만들어주는 MakeAry 함수를 제작
// 이후, 해당 숫자만큼 배열에 랜덤값 1~9 넣어주기
MakeAry(int size){
    int* temp = (int*)malloc(size * sizeof(int));
    for(int i=0;i<size;i++){
        temp[i]=rand()%9+1;
    }
    return temp;

}
// 배열과 숫자 넘겨받아 모든 배열요소를 출력하는 PrintAry 함수 제작
void PrintAry(int ary[], int size){
    for(int i=0;i<size;i++){
        printf("%d",ary[i]);
    }
    printf("\n");
}
// GetRandAry10은, size가 10인 int형 배열의 랜덤값이
// 10칸에 모두 1~9가 들어가있는 배열을 리턴하는 함수
int* GetRandAry10(){
    int* temp = (int*)malloc(10 * sizeof(int));
    for(int i=0;i<10;i++){
        temp[i] = rand()%9+1;
    }
    return temp;

}


// ===============================================================
int main(){
    srand(time(NULL));
    // --------------------------------------------------------
    int size = 10;
    int* ary = MakeAry(size);
    PrintAry(ary,10);
    GetRandAry10();

}// -=============================================================
/* ---------------------------------------------------------------

-------------------------------------------------------------------*/  